#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
google_bigquery_dataset.social_dataset: Refreshing state... [id=projects/ml-project-210100/datasets/social_dataset]
google_data_catalog_entry_group.social_data: Refreshing state... [id=projects/ml-project-210100/locations/asia-northeast1/entryGroups/social_data]
google_data_catalog_tag_template.data_ingestion: Refreshing state... [id=projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_bigquery_dataset.social_dataset must be replaced
-/+ resource "google_bigquery_dataset" "social_dataset" {
      ~ creation_time                   = 1620527119912 -> (known after apply)
      - default_partition_expiration_ms = 0 -> null
      - default_table_expiration_ms     = 0 -> null
      ~ etag                            = "h+2znzYgENbrd1DT0GZI0A==" -> (known after apply)
      ~ id                              = "projects/ml-project-210100/datasets/social_dataset" -> (known after apply)
      - labels                          = {} -> null
      ~ last_modified_time              = 1620527119912 -> (known after apply)
      ~ location                        = "asia-northeast1" -> "US" # forces replacement
      ~ project                         = "ml-project-210100" -> (known after apply)
      ~ self_link                       = "https://bigquery.googleapis.com/bigquery/v2/projects/ml-project-210100/datasets/social_dataset" -> (known after apply)
        # (2 unchanged attributes hidden)


        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>